Repository: nikeasyanzi/ldd6410
Catalog: trunk/utils/cpufrequtils-005/po/*.po
Languages: pt

source: Couldn't count the number of CPUs (%s: %s), assuming 1
pt: Não foi possível contar o número de CPUs (%s: %s), assumindo 1

source: minimum CPU frequency - maximum CPU frequency - governor
pt: frequência mínima do CPU - frequência máxima do CPU - governor

source: couldn't analyze CPU %d as it doesn't seem to be present
pt: não foi possível analisar o CPU %d já que ele parece não estar presente

source: analyzing CPU %d:
pt: analisando o CPU %d:

source: no or unknown cpufreq driver is active on this CPU
pt: nenhum ou driver do cpufreq desconhecido está ativo nesse CPU

source: CPUs which need to switch frequency at the same time:
pt: CPUs que precisam trocar de frequência ao mesmo tempo:

source: hardware limits:
pt: limites do hardware:

source: available frequency steps:
pt: valores de frequência disponíveis:

source: available cpufreq governors:
pt: governors do cpufreq disponíveis:

source: current policy: frequency should be within
pt: política atual: a frequência deveria estar entre

source: and
pt: e

source: The governor "%s" may decide which speed to use within this range.
pt: O governor "%s" deve decidir qual velocidade usar dentro desse limite.

source: current CPU frequency is
pt: frequência atual do CPU é

source: (asserted by call to hardware)
pt: (declarado por chamada ao hardware)

source: cpufreq stats:
pt: status do cpufreq:

source: Report errors and bugs to %s, please.
pt: Reporte erros e bugs para %s, por favor.

source: Usage: cpufreq-info [options]
pt: Uso: cpufreq-info [opções]

source: Options:
pt: Opções:

source: -c CPU, --cpu CPU CPU number which information shall be determined about
pt: -c CPU, --cpu CPU número do CPU sobre o qual as inforções devem ser determinadas

source: -e, --debug Prints out debug information
pt: -e, --debug Imprime informações de debug

source: -f, --freq Get frequency the CPU currently runs at, according to the cpufreq core *
pt: -f, --freq Obtém a frequência na qual o CPU está rodando no momento, de acordo com o núcleo do cpufreq *

source: -w, --hwfreq Get frequency the CPU currently runs at, by reading it from hardware (only available to root) *
pt: -w, --hwfreq Obtém a frequência na qual o CPU roda no momento, através de leitura no hardware (disponível somente para root) *

source: -l, --hwlimits Determine the minimum and maximum CPU frequency allowed *
pt: -l, --hwlimits Determina a frequência máxima e mínima permitida no CPU *

source: -d, --driver Determines the used cpufreq kernel driver *
pt: -d, --driver Determina o driver do kernel do cpufreq usado *

source: -p, --policy Gets the currently used cpufreq policy *
pt: --p, --policy Obtém a política do cpufreq usada no momento *

source: -g, --governors Determines available cpufreq governors *
pt: -g, --governors Determina os governors do cpufreq disponíveis *

source: -a, --affected-cpus Determines which CPUs can only switch frequency at the same time *
pt: -a, --affected-cpus Determina quais CPUs podem trocar de frequência somente ao mesmo tempo *

source: -s, --stats Shows cpufreq statistics if available
pt: -s, --stats Mostra estatísticas do cpufreq se disponíveis

source: -o, --proc Prints out information like provided by the /proc/cpufreq interface in 2.4. and early 2.6. kernels
pt: -o, --proc Imprime informações do tipo providas pela interface /proc/cpufreq em kernels 2.4 e 2.6 mais recentes

source: -m, --human human-readable output for the -f, -w and -s parameters
pt: -m, --human formato legível para os parâmetros -f, -w e -s

source: -h, --help Prints out this screen
pt: -h, --help Imprime essa tela

source: If no argument or only the -c, --cpu parameter is given, debug output about cpufreq is printed which is useful e.g. for reporting bugs.
pt: Se nenhum argumento ou somente o parâmetro -c, --cpu for dado, informação de debug do cpufreq é impressa, o que é útil, por exemplo, para reportar bugs.

source: For the arguments marked with *, omitting the -c or --cpu argument is equivalent to setting it to zero
pt: Para os argumentos marcados com *, omitir o argumento de -c ou --cpu é equivalente a setá-lo como zero

source: The argument passed to this tool can't be combined with passing a --cpu argument
pt: O argumento passado para essa ferramenta não pode ser combinado com um argumento passado à --cpu

source: You can't specify more than one --cpu parameter and/or more than one output-specific argument
pt: Você não pode especificar mais que um parâmetro para --cpu e/ou mais que um argumento de saída específico

source: invalid or unknown argument
pt: argumento inválido ou inexistente

source: Usage: cpufreq-set [options]
pt: Uso: cpufreq-set [opções]

source: -c CPU, --cpu CPU number of CPU where cpufreq settings shall be modified
pt: --c CPU, --cpu CPU número do CPU onde as configurações do cpufreq devem ser modificadas

source: -d FREQ, --min FREQ new minimum CPU frequency the governor may select
pt: -d FREQ, --min FREQ nova frequência mínima que o governor deve selecionar

source: -u FREQ, --max FREQ new maximum CPU frequency the governor may select
pt: -u FREQ, --max FREQ nova frequência máxima do CPU que o governor deve selecionar

source: -g GOV, --governor GOV new cpufreq governor
pt: -g GOV, --governor GOV novo governor do cpufreq

source: -f FREQ, --freq FREQ specific frequency to be set. Requires userspace governor to be available and loaded
pt: -f FREQ, --freq FREQ frequência específica pra ser setada. Requer o governor userspace disponível ou carregado

source: Notes: 1. Omitting the -c or --cpu argument is equivalent to setting it to zero 2. The -f FREQ, --freq FREQ parameter cannot be combined with any other parameter except the -c CPU, --cpu CPU parameter 3. FREQuencies can be passed in Hz, kHz (default), MHz, GHz, or THz by postfixing the value with the wanted unit name, without any space (FREQuency in kHz =^ Hz * 0.001 =^ MHz * 1000 =^ GHz * 1000000).
pt: Lembretes: 1. Omitir o argumento de -c ou --cpu é equivalente a setá-lo como zero 2. O parâmetro de -f FREQ, --freq Freq não pode ser combinado com qualquer outro parâmetro exceto com parâmetro de -c CPU, --cpu 3. FREQuências podem ser passadas em Hz, kHz (padrão), MHz, GHz, ou THz pósfixando o valor com o nome da unidade desejada, sem qualquer espaço em branco (FREQuência em kHz =^ Hz * 0.001 =^ MHz·*·1000·=^·GHz·*·1000000).

source: the -f/--freq parameter cannot be combined with -d/--min, -u/--max or -g/--governor parameters
pt: o parâmetro de -f/--freq não pode ser combinado com os parâmetros de -d/--min, -u/--max ou -g/--governor

source: At least one parameter out of -f/--freq, -d/--min, -u/--max, and -g/--governor must be passed
pt: Pelo menos um parâmetro além de -f/--freq, -d/--min, -u/--max e -g/--governor deve ser passado

source: wrong, unknown or unhandled CPU?
pt: CPU errado, desconhecido ou inesperado?

source: Error setting new values. Common errors: - Do you have proper administration rights? (super-user?) - Is the governor you requested available and modprobed? - Trying to set an invalid policy? - Trying to set a specific frequency, but userspace governor is not available, for example because of hardware which cannot be set to a specific frequency or because the userspace governor isn't loaded?
pt: Erro ao setar novos valores. Erros comuns: - Você tem os direitos necessários? (super-usuário?) - O governor que você requesitou está disponível ou ativado com o comando modprobe? - Tentando setar uma frequência específica, mas o governor userspace não está disponível, por exemplo devido ao hardware que não pode ser setado pra uma frequência específca ou porque o governor userspace não foi carregado?
